{
  "Butternut Squash Soup": {
    "img": "butternut-squash-soup.jpg",
    "description": "This butternut squash soup offers a delightful blend of sweet and savory flavors. The natural sweetness of the roasted butternut squash and caramelized yellow onion pairs beautifully with the earthy warmth of garlic. A hint of nutmeg adds a subtle spice that enhances the soup's richness, while a dash of black pepper balances the sweetness with a gentle kick. Perfect for cozy days, this soup delivers a velvety texture and layers of wholesome taste.",
    "time": {
      "prepTime": "15 minutes",
      "cookTime": "50 minutes"
    },
    "yield": "6 generous bowls",
    "ingredients": [
      "1 large butternut squash",
      "olive oil",
      "1/2 of a sweet yellow onion",
      "salt",
      "4 garlic cloves",
      "1/4 teaspoon ground nutmeg",
      "pepper, to taste",
      "3 to 4 cups vegetable broth",
      "1 to 2 tablespoons of butter"
    ],
    "instructions": [
      "Preheat the oven to 425 degrees Fahrenheit and line a rimmed baking sheet with parchment paper. Place the butternut squash on the pan and drizzle each half with just enough olive oil to lightly coat the squash on the inside (about ½ teaspoon each). Rub the oil over the inside of the squash and sprinkle it with salt and pepper.",
      "Turn the squash face down and roast until it is tender and completely cooked through, about 40 to 50 minutes (don’t worry if the skin or flesh browns—that’s good for flavor). Set the squash aside until it’s cool enough to handle, about 10 minutes.",
      "Meanwhile, in a large soup pot, warm 1 tablespoon olive oil over medium heat until shimmering, Add the chopped onion and 1 teaspoon salt. Stirring often until the onion has sofened and is golden on the edges. Add the garlic and cook until fragrant, about 1 minute, stirring frequently",
      "Use a spoon to scoop the butternut squash flesh into the soup pot. Discard the skin. Add the nutmeg and black pepper. Pour in 3 cups vegetable broth.",
      "Take an emulsion blender (or pour the mixture into a stand blender) and blend until smooth.",
      "Add butter, salt, and pepper to taste."
    ],
    "tags": {
      "meal": [
        "soup",
        "lunch",
        "dinner"
      ],
      "cuisine": [
        "southern"
      ],
      "ingredient": "vegetable-based",
      "season": [
        "winter",
        "autumn"
      ]
    }
  },
  "Chicken Pot Pie": {
    "img": "ClassicChickePotPie_12462-18_16x9.jpeg",
    "time": {
      "prepTime": "10 minutes",
      "cookTime": "30 minutes"
    },
    "yield": "6 servings",
    "ingredients": [
      "4 tablespoons butter - plus extra for the dish",
      "1 white or yellow onion - diced",
      "4 whole carrots - peeled and diced",
      "2 celery stalks - chopped",
      "salt and pepper - to taste",
      "1 tablespoon fresh thyme leaves",
      "2 medium-large chicken breasts - cut into 1-inch pieces",
      "3 tablespoons flour",
      "1 cup chicken broth",
      "1 ½ cups half and half - or whole milk",
      "¾ cup frozen peas",
      "2 sheets refrigerated pie crust - or one homemade pie crust",
      "1 egg - lightly beaten"
    ],
    "instructions": [
      "Preheat the oven to 425 degrees. Melt the butter in a large skillet, Dutch oven or frying pan set over a medium high heat.",
      "Stir in the onion, carrot and celery, along with a pinch of salt. Cook until the onions are soft and have started to color.",
      "Stir in the fresh thyme, followed by the chicken, seasoned well with salt and pepper. Cook until the chicken has started to brown. Sprinkle with the flour and cook for a further minute.",
      "Pour in the broth, and the heavy cream or milk. Cook, stirring often, until the sauce has thickened to slightly thinner than you want your finished pie filling. Stir in the frozen peas, and remove from the heat. Add a little more salt and pepper, if needed, and set aside to cool a little.",
      "While the filling is cooling, lightly butter a 9 inch pie plate and line with one of the pie crusts.",
      "Add the filling to the pie dish, and brush the exposed edges of the pastry with beaten egg. Lay the other pie crust on top, and press down to seal the edges. Trim off any excess with a sharp knife and crimp the edges.",
      "Brush the top of the pie with egg wash and cut a small slit in the middle to let out steam. Bake for 30-35 minutes, or until the pastry is cooked and the top is golden – you may need a little more or a little less baking time if your oven runs a little hot or a little cold.",
      "Let the pie to rest for 10-15 minutes before slicing."
    ],
    "tags": {
      "meal": [
        "dinner"
      ],
      "cuisine": [
        "southern"
      ],
      "ingredient": "chicken",
      "season": [
        "autumn",
        "winter"
      ]
    }
  },
  "Roasted Carrot & Ginger Soup": {
    "img": "roasted-carrot-ginger-soup.jpg",
    "time": {
      "prepTime": "15 minutes",
      "cookTime": "50 minutes"
    },
    "yield": "6 generous bowls",
    "ingredients": [
      "1 pound carrots, peeled and cut into large chunks",
      "1 cup yellow onion, cut half",
      "1 garlic clove, unpeeled",
      "2 tablespoons vegetable oil",
      "½ teaspoon salt",
      "Small pinch of pepper",
      "¼ teaspoon ground cumin",
      "5 cups vegetable stock, recipe link",
      "1 ½ tablespoons grated fresh ginger",
      "1 bay leaf"
    ],
    "instructions": [
      "Preheat oven to 375°F.",
      "Add the carrots, onion and garlic to a sheet pan/tray and spread out evenly. Drizzle with vegetable oil and an even sprinkling of salt, white pepper and cumin, mix until coated. Roast in the oven for 35 minutes until tender.",
      "To a large saucepan add the vegetable stock and bring to a simmer. Add the carrots, onions, garlic squeezed out of its peel, ginger and bay leaf. Simmer for 15 minutes.",
      "Remove the bay leaf. Using an immersion blender, or add to a blender in batches, blend soup until it is smooth and reaches the desired consistency, if it is too thick, add more stock.",
      "Check for seasoning and adjust to your taste."
    ],
    "tags": {
      "meal": [
        "lunch",
        "dinner",
        "soup"
      ],
      "cuisine": [
        "southern"
      ],
      "ingredient": "vegetable-based",
      "season": [
        "autumn",
        "winter"
      ]
    }
  },
  "Air Fryer Honey Mustard Salmon": {
    "img": "air-fryer-honey-mustard-salmon.jpg",
    "time": {
      "prepTime": "10 minutes",
      "cookTime": "15 minutes"
    },
    "yield": "2 salmon filets",
    "ingredients": [
      "2 salmon fillets (5-8 oz. each)",
      "2 tablespoons honey",
      "2 tablespoons whole grain Dijon mustard",
      "1/2 teaspoon garlic powder",
      "1/4 teaspoon smoked paprika",
      "1 teaspoon lemon juice",
      "Salt and pepper to taste"
    ],
    "instructions": [
      "Combine the sauce ingredients. Marinate the salmon in two-thirds (2/3) of the sauce for 30 minutes or toss the salmon fillets in the sauce until fully covered.",
      "Preheat air fryer to 400°F and place the salmon fillets in the air fryer. Baste the remaining marinade onto the salmon fillets.",
      "Air fry for 7-8 minutes, depending on the thickness of the salmon.",
      "Dish and serve hot drizzled with the remaining sauce."
    ],
    "tags": {
      "meal": [
        "dinner"
      ],
      "cuisine": [],
      "ingredient": "fish",
      "season": []
    }
  },
  "Moussaka (Greek Eggplant Lasagna)": {
    "img": "moussaka.webp",
    "time": {
      "prepTime": "15 minutes",
      "cookTime": "50 minutes"
    },
    "yield": "8 servings",
    "ingredients": {
      "Eggplant": [
        "2lb eggplant",
        "1 tsp salt",
        "2 - 3 tbsp olive oil"
      ],
      "Filling": [
        "1 tbsp olive oil",
        "1 onion",
        "3 garlic cloves (minced)",
        "1lb ground beef or lamb",
        "1/2 cup red wine",
        "14 oz crushed tomatoes",
        "3 tbsp tomato paste",
        "1 cup beef broth/stock",
        "1 beef bouillon cube",
        "2 bay leaves",
        "1.5 tsp sugar",
        "2 tsp dried oregano",
        "1/2 tsp cinnamon",
        "3/4 tsp salt"
      ],
      "Bechamel Sauce": [
        "4 tbsp butter",
        "5 tbsp plain flour",
        "2 1/2 cups milk",
        "1/4 tsp nutmeg, freshly grated (optional)",
        "1/2 cup parmesan cheese, grated",
        "1 egg",
        "1 egg yolk",
        "1 1/4 tsp Vegeta, vegetable or chicken stock powder",
        "1/4 tsp pepper"
      ]
    },
    "instructions": {
      "Eggplant": [
        "Place eggplant slightly overlapping in a large colander. Sprinkle with some salt. Repeat with remaining eggplant.",
        "Leave to sweat for 30 minutes. Meanwhile, make Meat Sauce and Béchamel Sauce.",
        "Preheat oven to 240C/450F. ",
        "Pat eggplant dry - make sure to do this well, otherwise it's too salty. Lay on parchment paper lined trays (you might need 3 trays, work in batches), brush with oil.",
        "Bake 15 - 20 minutes or until lightly browned and softened . Remove and set aside to cool slightly."
      ],
      "Meat Sauce": [
        "Heat olive oil in a large skillet or pot over high heat, then cook the garlic and onion for 2 minutes.",
        "Add the beef or lamb and cook until it changes from pink to brown, breaking it up as you go",
        "Add wine, cook for 1.5 minutes or until alcohol smell is gone.",
        "Add remaining ingredients and stir to combine. Bring to a simmer, then lower heat to medium low and cook for 15 minutes, or until reduced to a thick sauce"
      ],
      "Bechamel Sauce": [
        "Melt butter in a pan over medium heat. Add flour and cook for 1 minute, stirring constantly",
        "Stirring constantly, slowly add the milk. Then stir regularly for 3 to 5 minutes or until it thickens so that it thickly coats the back of a wooden spoon",
        "Remove from the stove and whisk in cheese, nutmeg, Vegeta/stock powder (or salt) and pepper.",
        "Allow to cool for 5 minutes, then whisk the eggs in. Cover with lid until required."
      ],
      "Assemble": [
        "Lower oven to 180C/350F (all oven types).",
        "Place half the eggplant in the bottom of a baking dish, then top with all the Filling.",
        "Top with remaining eggplant, then pour over the Béchamel Sauce, sprinkle with breadcrumbs.",
        "Bake for 30 - 40 minutes or until golden brown. Allow to stand for 10 minutes before serving."
      ]
    },
    "tags": {
      "meal": [
        "dinner"
      ],
      "cuisine": [
        "european"
      ],
      "ingredient": "vegetable-based",
      "season": []
    }
  },
  "Southwestern Chicken Burritos": {
    "img": "southwest-burrito.jpg",
    "time": {
      "prepTime": "15 minutes",
      "cookTime": "15 minutes"
    },
    "yield": "4 servings",
    "ingredients": [
      "2 boneless, skinless chicken breasts",
      "1 tsp ground coriander",
      "1 tsp ground cumin",
      "1 tsp chili powder",
      "½ tsp salt",
      "1 tbsp olive oil",
      "1 cup frozen corn",
      "1 can (15 oz) black beans, drained and rinsed",
      "4 large flour tortillas",
      "2 cups shredded lettuce",
      "1 cup crushed Fritos or tortilla chips",
      "½ cup salsa",
      "½ cup sour cream"
    ],
    "instructions": [
      "Prepare the Chicken: Slice the chicken breasts horizontally to create thin fillets. Season both sides with coriander, cumin, chili powder, and salt.",
      "Cook the Chicken: Heat olive oil in a skillet over medium heat. Cook the chicken for 3–4 minutes per side or until the internal temperature reaches 165°F. Remove from heat and let cool slightly.",
      "Heat the Sides: In the same skillet, sauté the frozen corn until slightly charred. Meanwhile, warm the black beans in a small pot over low heat.",
      "Shred the Chicken: Once cooled, use two forks to shred the chicken into bite-sized pieces.",
      "Assemble the Wraps: Place a tortilla on a plate. Layer shredded chicken, warm beans, corn, shredded lettuce, and a handful of crushed Fritos.",
      "Add Toppings & Serve: Drizzle with salsa and a dollop of sour cream. Wrap tightly and enjoy!"
    ],
    "tags": {
      "meal": [
        "lunch",
        "dinner"
      ],
      "cuisine": [],
      "ingredient": "chicken",
      "season": [
        "summer",
        "spring"
      ]
    }
  },
  "Baked Cajun Cabbage and Sausage": {
    "img": "cajun-cabbage.jpg",
    "time": {
      "prepTime": "15 minutes",
      "cookTime": "50 minutes"
    },
    "yield": "4 generous bowls",
    "ingredients": [
      "3 tablespoons unsalted butter",
      "12 ounces pre-cooked andouille or kielbasa sausage links, sliced into rounds",
      "1 cup chopped yellow onion",
      "4 garlic cloves, finely minced",
      "2 teaspoons packed brown sugar",
      "1 medium-sized head of green cabbage (about 2 lbs), roughly chopped into pieces",
      "2 tablespoons apple cider vinegar, sub for red wine vinegar",
      "2 teaspoons Cajun Seasoning",
      "1/4 teaspoon ground nutmeg"
    ],
    "instructions": [
      "In a large deep skillet or dutch oven, heat the butter over medium heat. Once the butter is sizzling, add the sausage rounds into the pan in an even single layer. Cook until golden brown, about 3-5 minutes per side. Then use a utensil to transfer the sausage to a plate and set aside.",
      "Add the chopped onion into the pan and sauté together until the onion becomes translucent and tender, about 2-3 minutes. Then add in the garlic and stir together along with the onion until the garlic is fragrant, about 1-2 minutes.",
      "Add in the brown sugar and stir together with the onion/garlic until the sugar begins to dissolve.",
      "Toss in the chopped cabbage- note: depending on the size of your pan, you may need to add in about half of the cabbage first. Then pour in the vinegar and carefully stir together. Cover the pan with a lid to allow the cabbage to steam through until tender, about 3-4 minutes. Then add in any remaining cabbage, if needed, and continue cooking for another 3-4 minutes. ",
      "Add the cooked sausage rounds back into the pan and seasoning the dish with the Creole Cajun seasoning, nutmeg, and red pepper flakes (if using). Stir everything together to fully combine. Allow the dish to continue cooking together for another 3-5 minutes and then remove from heat.",
      "Taste the cabbage and sausage and adjust seasoning by adding more Creole Cajun seasoning, if desired. Serve immediately and garnish with freshly chopped parsley if you’d like. Enjoy!"
    ],
    "tags": {
      "meal": [
        "dinner"
      ],
      "cuisine": [
        "southern"
      ],
      "ingredient": "pork",
      "season": []
    }
  },
  "Air Fryer Boneless Ribs": {
    "img": "air-fryer-ribs.jpg",
    "time": {
      "prepTime": "15 minutes",
      "cookTime": "50 minutes"
    },
    "yield": "4 servings",
    "ingredients": {
      "Ribs": [
        "1 lb. Country-Style Pork Ribs",
        "2 tsp Creole/Cajun Seasoning",
        "2 tsp Smokehouse Maple Seasoning"
      ],
      "BBQ Sauce": [
        "2 tablespoon Barbecue Sauce",
        "2 tablespoon Yellow Mustard",
        "1 tablespoon Black Vinegar (if you can’t find that, just use apple cider vinegar)",
        "1 tablespoon Brown Sugar"
      ]
    },
    "instructions": [
      "Mix the ingredients for the dry rub together, and coat each boneless rib in the seasoning. Allow to sit for 24 hours, if you can! At least 1 hour.",
      "Preheat your air fryer to 325˚, and while the air fryer preheats, drizzle 1 tablespoon olive oil on the ribs. Zhuzh them around so they are evenly coated.",
      "Place ribs in a single layer to the bottom of the air fryer basket. Air fry at 325˚ for 12 minutes.",
      "After 12 minutes, flip each rib over and cook again for another 12 minutes.",
      "While these cook, mix up your barbecue sauce.",
      "Slather the ribs with the sauce and cook an additional couple of minutes.",
      "Serve with extra sauce!"
    ],
    "tags": {
      "meal": [
        "dinner"
      ],
      "cuisine": [],
      "ingredient": "pork",
      "season": []
    }
  },
  "Japanese Soft-Scrambled Eggs Over Rice": {
    "img": "japanese-eggs.jpg",
    "time": {
      "prepTime": "1 minute",
      "cookTime": "5 minutes"
    },
    "yield": "1 bowl",
    "ingredients": [
      "3 eggs",
      "1 tbsp mirin",
      "1 tsp soy sauce",
      "¼ tsp salt",
      "2 tsp sesame oil",
      "1 spring onion (finely sliced)",
      "1 tbsp Japanese furikake rice seasoning",
      "1 cup white rice (cooked - leftover is best)"
    ],
    "instructions": [
      "Cook the rice if you're making it now and keep warm. If you're using leftover rice, reheat in the microwave and keep warm.",
      "Beat the eggs together with the mirin, soy sauce, salt, pepper and 1 tsp of the sesame oil.",
      "Heat a small frying pan with the remaining sesame oil until just hot - not too hot, we don't want the egg to cook too quickly.",
      "Pour the eggs into the pan and leave for a few seconds before stirring. Stir until just set, but still wet then remove from the heat - it will continue cook in the pan.",
      "Make a bed of the warm rice and then slide the eggs over the rice. Lastly, sprinkle with the spring onion and Japanese rice seasoning and enjoy right away!"
    ],
    "tags": {
      "meal": [
        "breakfast"
      ],
      "cuisine": [
        "asian"
      ],
      "ingredient": "",
      "season": []
    }
  },
  "Baked Bacon": {
    "img": "bacon.jpg",
    "time": {
      "prepTime": "15 minutes",
      "cookTime": "50 minutes"
    },
    "yield": "4 generous bowls",
    "ingredients": [
      "a pack of bacon"
    ],
    "instructions": [
      "Preheat your oven to 400°F (200°C). Line a baking tray with parchment paper, then place the bacon side-by-side on the tray.",
      "Cook the bacon for 10 to 20 minutes or until it's reached your desired level of crispiness. Make sure to check on it after about 10 minutes, as some ovens cook faster. Remove the tray from the oven and transfer the bacon with tongs to a paper towel-lined plate."
    ],
    "tags": {
      "meal": [
        "breakfast"
      ],
      "cuisine": [],
      "ingredient": "pork",
      "season": []
    }
  },
  "Greek Pasta Salad": {
    "img": "greek-pasta-salad.jpg",
    "time": {
      "prepTime": "15 minutes",
      "cookTime": "12 minutes"
    },
    "yield": "4 generous bowls",
    "ingredients": {
      "Pasta Salad": [
        "16 ounces rotini or other medium pasta",
        "¾ English cucumber diced",
        "1 pint grape tomatoes halved",
        "1 bell pepper red or orange, diced",
        "½ cup sliced pitted olives",
        "½ cup crumbled feta cheese",
        "⅓ cup diced red onion"
      ],
      "Dressing": [
        "1 cup Greek dressing"
      ],
      "or": [
        "¼ cup red wine vinegar",
        "⅓ cup olive oil",
        "½ teaspoon garlic powder",
        "1 teaspoon dried oregano",
        "salt and pepper to taste"
      ]
    },
    "instructions": [
      "Whisk together dressing ingredients.",
      "Cook pasta al dente according to package directions. Rinse under cold water.",
      "Combine all ingredients in a large bowl. Add dressing and toss.",
      "Refrigerate at least 2 hours before serving."
    ],
    "tags": {
      "meal": [
        "lunch",
        "dinner"
      ],
      "cuisine": [
        "european"
      ],
      "ingredient": "pasta",
      "season": [
        "spring",
        "summer"
      ]
    }
  },
  "Creamy Orzo and Chicken": {
    "img": "chicken-orzo.jpg",
    "time": {
      "prepTime": "15 minutes",
      "cookTime": "50 minutes"
    },
    "yield": "4 generous bowls",
    "ingredients": {
      "chicken": [
        "1.5 lb chicken breasts skinless, boneless",
        "1 teaspoon smoked paprika",
        "1 teaspoon Italian seasoning",
        "salt and freshly ground black pepper",
        "2 tablespoons olive oil"
      ],
      "orzo": [
        "1 cup orzo uncooked",
        "5 cloves garlic minced",
        "1 tablespoon olive oil",
        "10 oz cherry tomatoes sliced in half",
        "2 cups chicken stock",
        "¼ teaspoon salt",
        "5 oz fresh spinach",
        "½ cup heavy cream",
        "¼ cup basil pesto"
      ]
    },
    "instructions": {
      "chicken": [
        "Slice chicken breasts into thinner strips. Generously season the chicken with smoked paprika, Italian seasoning, salt, and pepper.",
        "Heat a large, high-sided, heavy-bottomed skillet over medium heat. Add 2 tablespoons of olive oil. Add chicken. Cook the chicken on medium heat for about 3 minutes per side. Remove chicken to a plate."
      ],
      "orzo": [
        "To the same, now empty, skillet, add 1 cup of uncooked orzo, 5 cloves of minced garlic, and 1 tablespoon of olive oil. Cook the orzo on medium heat, stirring, for about 2 minutes until browned.",
        "Add 2 cups of chicken stock, half of the cherry tomatoes, and ¼ teaspoon of salt. Bring to a boil, then reduce to a simmer and cook for about 5 or 10 minutes, occasionally stirring to prevent the orzo from sticking to the bottom of the pan, until the orzo is cooked through.",
        "Add spinach and the remaining cherry tomatoes. Stir everything on low-medium heat until the spinach wilts.",
        "Add heavy cream and basil pesto to the skillet with orzo and veggies and stir to combine. Season with salt and pepper, if desired.",
        "Return the chicken to the skillet. Allow the chicken to simmer in the sauce to heat through and until the chicken is completely cooked through."
      ]
    },
    "tags": {
      "meal": [
        "dinner"
      ],
      "cuisine": [],
      "ingredient": "chicken",
      "season": []
    }
  },
  "Crispy Baby Potatoes": {
    "img": "potatoes.jpg",
    "time": {
      "prepTime": "15 minutes",
      "cookTime": "50 minutes"
    },
    "yield": "4 generous bowls",
    "ingredients": [
      "1 1/2 pounds small baby potatoes, red, Yukon gold or multi-color",
      "3 tablespoons extra virgin olive oil",
      "1 teaspoon garlic powder",
      "1 1/4 teaspoons dried Italian seasoning",
      "1 1/2 tablespoons grated Pecorino Romano or Parmesan cheese",
      "1/2 teaspoon kosher salt, plus more for topping",
      "ground black pepper",
      "olive oil spray"
    ],
    "instructions": [
      "Preheat the oven to 400F and set the rack for the center of the oven. Cut the potatoes in half.",
      "Drizzle the olive oil on the bottom of the sheet pan, spreading out to evenly cover the bottom.",
      "Evenly sprinkle the oil with the garlic powder, Italian seasoning, grated cheese, salt and pepper.",
      "Place the potatoes over the seasoning, cut side down in an even layer. Spritz the tops of the potatoes with olive oil spray and season the tops with a pinch more salt.",
      "Bake in the center of the oven, 30 to 40 minutes, depending on the size of the potatoes, until the bottoms are golden and the potatoes are tender when pierced with a knife."
    ],
    "tags": {
      "meal": [
        "lunch",
        "dinner"
      ],
      "cuisine": [],
      "ingredient": "vegetable-based",
      "season": []
    }
  }
}